<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Carbon\Carbon;

class PalestineSubjectsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $now = Carbon::now();

        $grades_subjects = [
          1 => ['لغتنا الجميلة', 'اللغة الإنجليزية', 'التربية الإسلامية', 'الرياضيات', 'التربية الوطنية والحياتية'],
          2 => ['لغتنا الجميلة', 'اللغة الإنجليزية', 'التربية الإسلامية', 'الرياضيات', 'التربية الوطنية والحياتية'],
          3 => ['لغتنا الجميلة', 'اللغة الإنجليزية', 'التربية الإسلامية', 'الرياضيات', 'التربية الوطنية والحياتية', 'العلوم والحياة'],
          4 => ['لغتنا الجميلة', 'اللغة الإنجليزية', 'التربية الإسلامية', 'الرياضيات', 'التنشئة الوطنية والاجتماعية', 'العلوم والحياة'],
          5 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'الدراسات الاجتماعية', 'البرمجة'],
          6 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'الدراسات الاجتماعية', 'البرمجة'],
          7 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'الدراسات الاجتماعية', 'البرمجة', 'اللغة الفرنسية'],
          8 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'الدراسات الاجتماعية', 'البرمجة', 'اللغة الفرنسية'],
          9 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'الدراسات الاجتماعية', 'البرمجة', 'اللغة الفرنسية'],
          10 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'الدراسات الاجتماعية', 'البرمجة', 'اللغة الفرنسية'],
          11 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية', 'الحاسوب', 'الثقافة المالية'],
          12 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية', 'الحاسوب', 'الثقافة المالية'],
         
      ];



        $school_classes = DB::table('school_classes')->get();

        foreach ($grades_subjects as $grade_level => $subjects_list) {

            $class = $school_classes->where('grade_level', $grade_level)->first();
            if ($class) {
                foreach ($subjects_list as $subject_name) {
                    DB::table('subjects')->insert([
                        'subject_name' => $subject_name,
                        'grade_level' => $class->id,
                        'created_at' => $now,
                        'updated_at' => $now,
                    ]);
                }
            }
        }
    }
}
