<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Carbon\Carbon;

class SaudiSubjectsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run()
    {
        $now = Carbon::now();

        $grades_subjects = [
            1 => ['العلوم', 'الفقه والسلوك', 'التوحيد', 'التربية الأسرية', 'الرياضيات', 'لغتي'],
            2 => ['العلوم', 'الرياضيات', 'الفقه والسلوك', 'التوحيد', 'التربية الأسرية', 'لغتي'],
            3 => ['العلوم', 'الرياضيات', 'الفقه والسلوك', 'التوحيد', 'التربية الأسرية', 'لغتي'],
            4 => ['العلوم', 'الدراسات الإجتماعية', 'الحديث والسيرة', 'الفقة والسلوك', 'التوحيد', 'الرياضيات', 'التربية الأسرية', 'لغتي الجميلة'],
            5 => ['العلوم', 'الدراسات الإجتماعية والمواطنة', 'لغتي الجميلة', 'الرياضيات', 'الحديث والسيرة', 'الفقه والسلوك', 'التوحيد', 'التربية الأسرية', 'التلاوة والتجويد'],
            6 => ['العلوم', 'الدراسات الإجتماعية والمواطنة', 'الحديث والسيرة', 'التوحيد', 'التلاوة والتجويد', 'الفقه والسلوك', 'الرياضيات', 'التربية الأسرية', 'لغتي الجميلة'],
            7 => ['العلوم', 'الدراسات الإجتماعية والمواطنة', 'الحديث', 'التفسير', 'التجويد', 'الفقه', 'التوحيد', 'لغتي الخالدة', 'الحاسب وتقنية المعلومات', 'الرياضيات', 'التربية الأسرية'],
            8 => ['العلوم', 'الدراسات الإجتماعية والمواطنة', 'الحاسب وتقنية المعلومات', 'الحديث', 'الفقه', 'التفسير', 'التوحيد', 'الرياضيات', 'التربية الأسرية', 'لغتي الخالدة'],
            9 => ['العلوم', 'الدراسات الإجتماعية والمواطنة', 'الحاسب وتقنية المعلومات', 'الحديث', 'الفقه', 'التوحيد', 'الرياضيات', 'التربية الأسرية', 'لغتي الخالدة'],
            10 => ['اللغة العربية', 'الكيمياء', 'الأحياء'],

        ];


        $school_classes = DB::connection('sa')->table('school_classes')->get();

        foreach ($grades_subjects as $grade_level => $subjects_list) {
            $class = $school_classes->where('grade_level', $grade_level)->first();
            if ($class) {
                foreach ($subjects_list as $subject_name) {
                    DB::connection('sa')->table('subjects')->insert([
                        'subject_name' => $subject_name,
                        'grade_level' => $class->id,
                        'created_at' => $now,
                        'updated_at' => $now,
                    ]);
                }
            }
        }
    }
}
