<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use App\Models\SchoolClass;
use Carbon\Carbon;

class SubjectSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $now = Carbon::now();

        $grades_subjects = [
            1 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية'],
            2 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية'],
            3 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية'],
            4 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية'],
            5 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية'],
            6 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية'],
            7 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية'],
            8 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية', 'الحاسوب'],
            9 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية', 'الحاسوب', 'الثقافة المالية'],
            10 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية', 'الحاسوب', 'الثقافة المالية'],
            11 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية', 'الحاسوب', 'الثقافة المالية'],
            12 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم العامة', 'الرياضيات', 'التربية الرياضية والفنية', 'التربية الاجتماعية', 'التربية المهنية', 'الحاسوب', 'الثقافة المالية'],
            13 => ['اللغة العربية', 'اللغة الإنجليزية', 'التربية الإسلامية', 'العلوم الإسلامية', 'العلوم العامة', 'الرياضيات بجميع فروعها', 'المواد الاجتماعية', 'الحاسوب'],
        ];


        $school_classes = DB::table('school_classes')->get();

        foreach ($grades_subjects as $grade_level => $subjects_list) {

            $class = $school_classes->where('grade_level', $grade_level)->first();
            if ($class) {
                foreach ($subjects_list as $subject_name) {
                    DB::table('subjects')->insert([
                        'subject_name' => $subject_name,
                        'grade_level' => $class->id, 
                        'created_at' => $now,
                        'updated_at' => $now,
                    ]);
                }
            }
        }
    }
}
